{
    "name": {
        "ara": "طَابَ لِي خَلْعُ عِذَارِي",
        "en": "Ṭāba lī khalʻu ʻidhārī – My wantonness befits me"
    },
    "verses": {
        "ara": [
            "طَابَ لِي خَلْعُ عِذَارِي فِي هَوَى الْبَدْرِ التَّمَامْ",
            "بِافْتِقَارِي وَانْكِسَارِي أَرْتَجِيْ نَيْلَ الْمَرَامْ",

            "يَا عَذُوْلِي لَا تَلُمْنِي مَا عَلَى الْعَاشِقُ مَلَامْ",
            "اُدْنُ مِنِّي وَارْوِ عَنِّيْ أَنَا فِي الْعِشْقِ إِمَامْ",

            "خَمْرَةُ الْأَحْبَابِ تُجْلَ هِيَ حِلٌّ لَا حَرَامْ",
            "مِنْ عُيُونِ الْعِيْنِ تُمْلَى صَانَهَا الْبَرُّ السَّلَامْ",

            "يَا أَخَا الْأَشْوَاقِ يَمِّمْ  سَيِّدَ الرُّسْلِ الْكِرَامْ",
            "وَاغْنَمِ الذِّكْرَ وَزَمْزِمْ بِصَلَاةٍ مَعْ سَلَامْ",

            "لِحَبِيْبِ الله أَحْمَدْ  كُلَّمَا جَنَّ الظَّلَامْ",
            "كُلُّ مَنْ وَالَاهُ يَسْعَدْ وَيَنَالْ حُسْنَ الْخِتَامْ"
        ],
        "en": [
            "Ṭāba li khalʻu ʻiḏhārī fī hawā al-badri al-tamām",
            "Bi-iftiqārī wa-ankisārī artajī nayla al-maram",

            "Yā ʻaḏūlī lā talumnī mā ʻalā al-ʻāshiqu malām",
            "Udnu minnī wa-rwi ʻanī anā fī al-ʻishqi imām",

            "Khamratu al-ahbābi tujla hiya ḥillun lā ḥarām",
            "Min ʻuyūni al-ʻayni tumla ṣānaha al-barru al-salām",

            "Yā akhā al-ashwāqi yammim sayyida al-rusli al-kirām",
            "Wa-ighnam al-dhikra wa-zamzim bi-ṣalātin maʻ salām",

            "Li-ḥabībi Llāh Aḥmad kullamā janna al-ẓalām",
            "Kullu man wālahu yasʻad wa-yanāl ḥusna al-khitām"
        ]
    },
    "translation": {
        "en": [
            "My wantonness befits me, in my desire for the perfect fullmoon.",
            "By my poverty and my brokenness,  I hope to attain that for which I long.",

            "O foul critic, do not blame me, how can the lover be blamed?",
            "Leave me and relate from me, I am of love an *imam*.",

            "Let liquor of the beloveds become clear; it is *halal*, not *haram*.",
            "From the eye's springs up may it well; may the pious preserve it in peace.",

            "O brother of yearnings, venture to the Master of the Noble Prophets!",
            "And sing remembrance and murmur blessings upon him and peace.",

            "For the Beloved of Allah, Ahmad; however much the dark may descend.",
            "For all who ally him prosper, and attain beauteous good at their end."
        ]
    },
    "order": {
        "chorus": [
            [
                {"repeat": 1, "index": 0 },
                {"repeat": 1, "index": 1 }
            ]

        ],
        "verses": [
            [
                {"repeat": 1, "index": 2 },
                {"repeat": 1, "index": 3 }
            ],
            [
                {"repeat": 1, "index": 4 },
                {"repeat": 1, "index": 5 }
            ],
            [
                {"repeat": 1, "index": 6 },
                {"repeat": 1, "index": 7 }
            ],
            [
                {"repeat": 1, "index": 8 },
                {"repeat": 1, "index": 9 }
            ]
        ]
    }
}
